upstairs = 0
S = None
Ba = 308
SL = 180
SR = 180


angle = 0
distance = 0
FOOT = []
h = -190

b_LB = []
b_LF = []
b_RB = []
b_RF = []




RBxref = -154 #ÓÒºó÷Å¹Ø½Úx×ø±ê
RByref = -87.5 #÷Å¹Ø½Úy×ø±ê
RBzref = -20 #÷Å¹Ø½Úz×ø±ê
RBL1 = 58	#µÚÒ»¹Ø½Ú³¤¶È
RBL2 = 44 #µÚ¶þ¹Ø½Ú³¤¶È
RBL3 = 79.5 #µÚÈý¹Ø½Ú³¤¶È
RBL1S = 3364 #L1µÄÆ½·½
RBL2S = 1936 #L2µÄÆ½·½
RBL3S = 6320.25 #L3µÄÆ½·½

RFxref = 154 #ÓÒÇ°ÍÈ÷Å¹Ø½Úx×ø±ê
RFyref = -87.5 #÷Å¹Ø½Úy×ø±ê
RFzref = -20 #÷Å¹Ø½Úz×ø±ê
RFL1 = 58	#µÚÒ»¹Ø½Ú³¤¶È
RFL2 = 44 #µÚ¶þ¹Ø½Ú³¤¶È
RFL3 = 79.5 #µÚÈý¹Ø½Ú³¤¶È
RFL1S = 3364 #L1µÄÆ½·½
RFL2S = 1936 #L2µÄÆ½·½
RL3S = 6320.25 #L3µÄÆ½·½

LBxref = -154 #÷Å¹Ø½Úx×ø±ê
LByref = 87.5 #÷Å¹Ø½Úy×ø±ê
LBzref = -20 #÷Å¹Ø½Úz×ø±ê
LBL1 = 58	#µÚÒ»¹Ø½Ú³¤¶È
LBL2 = 44 #µÚ¶þ¹Ø½Ú³¤¶È
LBL3 = 79.5 #µÚÈý¹Ø½Ú³¤¶È
LBL1S = 3364 #L1µÄÆ½·½
LBL2S = 1936 #L2µÄÆ½·½
LBL3S = 6320.25 #L3µÄÆ½·½

LFxref = 154 #÷Å¹Ø½Úx×ø±ê
LFyref = 87.5 #÷Å¹Ø½Úy×ø±ê
LFzref = -20 #÷Å¹Ø½Úz×ø±ê
LFL1 = 58	#µÚÒ»¹Ø½Ú³¤¶È
LFL2 = 73 #µÚ¶þ¹Ø½Ú³¤¶È
LFL3 = 73	 #µÚÈý¹Ø½Ú³¤¶È
LFL1S = 3364 #L1µÄÆ½·½
LFL2S = 5329 #L2µÄÆ½·½
LFL3S = 5329 #L3µÄÆ½·½

H = 40.00 #¿ç²½¸ß¶È
T = 1.0 #ÖÜÆÚ
pi = 3.14 #¦Ð
b = 175.00 #¿í
m = 0 #ÖÊÁ¿
g = 0 #ÖØÁ¦ÏµÊý
J = 0 #×ª¶¯¹ßÁ¿
LFw = -87.5 #y×ø±ê ×óÇ° 
LBw = -87.5 #y×ø±ê ×óºó 
RFw = 87.5 #y×ø±ê 
RBw = 87.5 #y×ø±ê
